# WAVES

In [1]:
import pyodbc
import pandas as pd

In [2]:
cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "Trusted_Connection=yes;")

### Query

In [3]:
df = pd.read_sql_query("SELECT CONVERT(varchar,w.releaseDate,100) Date, w.id, wa.name Warehouse, s.lookupCode Shipments, p.name Customer, ss.name ShipmentStatus\
    FROM datex_footprint.Waves w\
    JOIN datex_footprint.WaveStatuses ws\
        ON ws.id = w.statusId\
    JOIN datex_footprint.Warehouses wa\
        ON wa.id = w.warehouseId\
    JOIN datex_footprint.shipments s\
        ON s.waveId = w.id\
    JOIN datex_footprint.ShipmentOrderLookup sol\
        ON sol.shipmentId = s.id\
    JOIN datex_footprint.Orders o\
        ON o.id = sol.orderId\
    JOIN datex_footprint.Projects p\
        ON p.id = o.projectId\
    JOIN datex_footprint.ShipmentStatuses ss\
        ON ss.id = s.statusId\
    WHERE releaseDate > dateadd(day,-1,getdate())\
        AND w.statusId = 3\
    ORDER BY releaseDate DESC", cnxn)

# Create Waves Table Data

In [4]:
df.head(10)

,Date,id,Warehouse,Shipments,Customer,ShipmentStatus
0,Aug 10 2022 10:22AM,243867,12,8385111,"NBTY Global, Inc.",Released
1,Aug 10 2022 10:22AM,243864,15,8381355,"Mizner Bioscience, LLC",Released
2,Aug 10 2022 10:22AM,243864,15,8381356,"Mizner Bioscience, LLC",Released
3,Aug 10 2022 10:22AM,243864,15,8381357,"Mizner Bioscience, LLC",Released
4,Aug 10 2022 10:21AM,243866,10,8380597,Eywa Pharma Inc.,Released
5,Aug 10 2022 10:21AM,243866,10,8380598,Eywa Pharma Inc.,Released
6,Aug 10 2022 10:21AM,243866,10,8380599,Eywa Pharma Inc.,Released
7,Aug 10 2022 10:21AM,243866,10,8380607,Eywa Pharma Inc.,Released
8,Aug 10 2022 10:21AM,243866,10,8380608,Eywa Pharma Inc.,Released
9,Aug 10 2022 10:21AM,243866,10,8380609,Eywa Pharma Inc.,Released

In [5]:
# Count Shipments per Wave and Status
count_shipments_statusdf = df.groupby(['id', 'ShipmentStatus']).count()[['Shipments']]
count_shipments_statusdf.reset_index(inplace=True)
count_shipments_statusdf.tail()

        id ShipmentStatus  Shipments
39  243863       Released          5
40  243864       Released          3
41  243865       Released          1
42  243866       Released         20
43  243867       Released          1

In [6]:
# Convert Statuses to Columns
shipment_pivot = count_shipments_statusdf.pivot(index='id', columns='ShipmentStatus', values='Shipments')
shipment_pivot.tail()

ShipmentStatus  Completed  Executing  Released
id
243863                NaN        NaN       5.0
243864                NaN        NaN       3.0
243865                NaN        NaN       1.0
243866                NaN        NaN      20.0
243867                NaN        NaN       1.0

In [7]:
# Convert NaN to 0
shipment_pivot = shipment_pivot.fillna(0)
shipment_pivot.head()

ShipmentStatus  Completed  Executing  Released
id
243768               21.0        4.0       0.0
243769                0.0        0.0       9.0
243771                1.0        3.0       2.0
243778                5.0       22.0       2.0
243783                0.0        1.0       0.0

In [8]:
# Convert Float to Int
try:
    shipment_pivot['Completed'] = shipment_pivot['Completed'].astype(int)
except:
    print('Column Completed does not exist yet')

try:
    shipment_pivot['Executing'] = shipment_pivot['Executing'].astype(int)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'] = shipment_pivot['Released'].astype(int)
except:
    print('Column Released does not exist yet')

shipment_pivot.head()

ShipmentStatus  Completed  Executing  Released
id
243768                 21          4         0
243769                  0          0         9
243771                  1          3         2
243778                  5         22         2
243783                  0          1         0

In [9]:
# Convert id index to a column
shipment_pivot.reset_index(inplace=True)
shipment_pivot.head()

ShipmentStatus      id  Completed  Executing  Released
0               243768         21          4         0
1               243769          0          0         9
2               243771          1          3         2
3               243778          5         22         2
4               243783          0          1         0

In [10]:
# Convert zeros to blanks. This also change the data type to String
try:
    shipment_pivot['Completed'].replace([0, ''], '', inplace=True)
except:
    print('Column Completed does not exist yet')
    
try:
    shipment_pivot['Executing'].replace([0, ''], '', inplace=True)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'].replace([0, ''], '', inplace=True)
except:
    print('Column Released does not exist yet')
    
shipment_pivot.head()

ShipmentStatus      id Completed Executing Released
0               243768        21         4
1               243769                            9
2               243771         1         3        2
3               243778         5        22        2
4               243783                   1

In [11]:
shipment_pivot.dtypes

ShipmentStatus
id            int64
Completed    object
Executing    object
Released     object
dtype: object

In [12]:
# Change columns order
df = df[['Date', 'id', 'Warehouse', 'Customer']]

In [13]:
# Drops duplicates
df = df.drop_duplicates()

In [14]:
df.head(10)

,Date,id,Warehouse,Customer
0,Aug 10 2022 10:22AM,243867,12,"NBTY Global, Inc."
1,Aug 10 2022 10:22AM,243864,15,"Mizner Bioscience, LLC"
4,Aug 10 2022 10:21AM,243866,10,Eywa Pharma Inc.
24,Aug 10 2022 10:21AM,243863,15,"Carwin Pharmaceutical Associates, LLC"
29,Aug 10 2022 10:19AM,243865,16,American International Chemical
30,Aug 10 2022 10:19AM,243847,20,Alumier Labs Inc.
50,Aug 10 2022 10:08AM,243862,15,"Brookfield Pharmaceuticals, LLC"
71,Aug 10 2022 10:06AM,243860,15,"Alliance Pharma, Inc."
107,Aug 10 2022 9:57AM,243861,19,"GUSA Granules USA, Inc."
108,Aug 10 2022 9:39AM,243857,20,"ACI Healthcare USA, Inc."

In [15]:
# Merge df with pivot table
df2 = df.merge(shipment_pivot, left_on='id', right_on='id')
df2.head(10)

,Date,id,Warehouse,Customer,Completed,Executing,Released
0,Aug 10 2022 10:22AM,243867,12,"NBTY Global, Inc.",,,1
1,Aug 10 2022 10:22AM,243864,15,"Mizner Bioscience, LLC",,,3
2,Aug 10 2022 10:21AM,243866,10,Eywa Pharma Inc.,,,20
3,Aug 10 2022 10:21AM,243863,15,"Carwin Pharmaceutical Associates, LLC",,,5
4,Aug 10 2022 10:19AM,243865,16,American International Chemical,,,1
5,Aug 10 2022 10:19AM,243847,20,Alumier Labs Inc.,,,20
6,Aug 10 2022 10:08AM,243862,15,"Brookfield Pharmaceuticals, LLC",,,21
7,Aug 10 2022 10:06AM,243860,15,"Alliance Pharma, Inc.",,,36
8,Aug 10 2022 9:57AM,243861,19,"GUSA Granules USA, Inc.",,,1
9,Aug 10 2022 9:39AM,243857,20,"ACI Healthcare USA, Inc.",,,1

In [16]:
wave_df = pd.DataFrame()
statuses = list(df2.columns)

# Reorder columns
if ('Released' in statuses) and ('Executing' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing', 'Completed']]
elif ('Released' in statuses) and ('Executing' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing']]
elif ('Released' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Completed']]
elif ('Released' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released']]
else:
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer']]

In [17]:
wave_df.head(10)

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Aug 10 2022 10:22AM,243867,12,"NBTY Global, Inc.",1,,
1,Aug 10 2022 10:22AM,243864,15,"Mizner Bioscience, LLC",3,,
2,Aug 10 2022 10:21AM,243866,10,Eywa Pharma Inc.,20,,
3,Aug 10 2022 10:21AM,243863,15,"Carwin Pharmaceutical Associates, LLC",5,,
4,Aug 10 2022 10:19AM,243865,16,American International Chemical,1,,
5,Aug 10 2022 10:19AM,243847,20,Alumier Labs Inc.,20,,
6,Aug 10 2022 10:08AM,243862,15,"Brookfield Pharmaceuticals, LLC",21,,
7,Aug 10 2022 10:06AM,243860,15,"Alliance Pharma, Inc.",36,,
8,Aug 10 2022 9:57AM,243861,19,"GUSA Granules USA, Inc.",1,,
9,Aug 10 2022 9:39AM,243857,20,"ACI Healthcare USA, Inc.",1,,

In [18]:
# Save Waves DF into json file
wave_df.to_json('data/waves.json')

# Warehouse Pie Chart Data

In [19]:
# Save df2 in df3
warehouse_df = wave_df
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Aug 10 2022 10:22AM,243867,12,"NBTY Global, Inc.",1,,
1,Aug 10 2022 10:22AM,243864,15,"Mizner Bioscience, LLC",3,,
2,Aug 10 2022 10:21AM,243866,10,Eywa Pharma Inc.,20,,
3,Aug 10 2022 10:21AM,243863,15,"Carwin Pharmaceutical Associates, LLC",5,,
4,Aug 10 2022 10:19AM,243865,16,American International Chemical,1,,

In [20]:
# Conver String to Float
try:
    warehouse_df['Released'] = pd.to_numeric(warehouse_df['Released'],errors='coerce')
except:
    print('Column Released does not exist yet')

try:
    warehouse_df['Executing'] = pd.to_numeric(warehouse_df['Executing'],errors='coerce')
except:
    print('Column Executing does not exist yet')

try:
    warehouse_df['Completed'] = pd.to_numeric(warehouse_df['Completed'],errors='coerce')
except:
    print('Column Completed does not exist yet')

warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Aug 10 2022 10:22AM,243867,12,"NBTY Global, Inc.",1.0,NaN,NaN
1,Aug 10 2022 10:22AM,243864,15,"Mizner Bioscience, LLC",3.0,NaN,NaN
2,Aug 10 2022 10:21AM,243866,10,Eywa Pharma Inc.,20.0,NaN,NaN
3,Aug 10 2022 10:21AM,243863,15,"Carwin Pharmaceutical Associates, LLC",5.0,NaN,NaN
4,Aug 10 2022 10:19AM,243865,16,American International Chemical,1.0,NaN,NaN

In [21]:
# Conver NaN to Zero
warehouse_df = warehouse_df.fillna(0)
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Aug 10 2022 10:22AM,243867,12,"NBTY Global, Inc.",1.0,0.0,0.0
1,Aug 10 2022 10:22AM,243864,15,"Mizner Bioscience, LLC",3.0,0.0,0.0
2,Aug 10 2022 10:21AM,243866,10,Eywa Pharma Inc.,20.0,0.0,0.0
3,Aug 10 2022 10:21AM,243863,15,"Carwin Pharmaceutical Associates, LLC",5.0,0.0,0.0
4,Aug 10 2022 10:19AM,243865,16,American International Chemical,1.0,0.0,0.0

In [22]:
# Group by Warehouse
warehouse_df = warehouse_df.groupby(['Warehouse']).sum()
warehouse_df

                id  Released  Executing  Completed
Warehouse
10         2438310      46.0       17.0        9.0
102         243818       1.0        0.0        0.0
12          731500       1.0        2.0        0.0
15          975449      65.0        0.0        0.0
16          243865       1.0        0.0        0.0
19          975257      15.0       18.0       29.0
20         1462864      69.0       55.0        5.0
21          731489       3.0        0.0        0.0

In [23]:
# Reset Index
warehouse_df.reset_index(inplace=True)
warehouse_df

  Warehouse       id  Released  Executing  Completed
0        10  2438310      46.0       17.0        9.0
1       102   243818       1.0        0.0        0.0
2        12   731500       1.0        2.0        0.0
3        15   975449      65.0        0.0        0.0
4        16   243865       1.0        0.0        0.0
5        19   975257      15.0       18.0       29.0
6        20  1462864      69.0       55.0        5.0
7        21   731489       3.0        0.0        0.0

In [24]:
warehouses = list(warehouse_df.columns)
warehouse_df2 = pd.DataFrame()

if ('Released' in warehouses) and ('Executing' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing', 'Completed']]
elif ('Released' in warehouses) and ('Executing' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing']]
elif ('Released' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Completed']]
elif ('Released' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released']]
else:
    warehouse_df2 = warehouse_df[['Warehouse']]

warehouse_df2

  Warehouse  Released  Executing  Completed
0        10      46.0       17.0        9.0
1       102       1.0        0.0        0.0
2        12       1.0        2.0        0.0
3        15      65.0        0.0        0.0
4        16       1.0        0.0        0.0
5        19      15.0       18.0       29.0
6        20      69.0       55.0        5.0
7        21       3.0        0.0        0.0

In [25]:
warehouse_df2 = pd.melt(warehouse_df2, id_vars=["Warehouse"], 
                  var_name="Status", value_name="Value")
warehouse_df2.head()

  Warehouse    Status  Value
0        10  Released   46.0
1       102  Released    1.0
2        12  Released    1.0
3        15  Released   65.0
4        16  Released    1.0

In [26]:
warehouse_df3 = warehouse_df2.pivot(index ='Status', columns='Warehouse', values='Value')
warehouse_df3

Warehouse    10  102   12    15   16    19    20   21
Status
Completed   9.0  0.0  0.0   0.0  0.0  29.0   5.0  0.0
Executing  17.0  0.0  2.0   0.0  0.0  18.0  55.0  0.0
Released   46.0  1.0  1.0  65.0  1.0  15.0  69.0  3.0

In [27]:
warehouse_df4 = warehouse_df3.reset_index()
warehouse_df4

Warehouse     Status    10  102   12    15   16    19    20   21
0          Completed   9.0  0.0  0.0   0.0  0.0  29.0   5.0  0.0
1          Executing  17.0  0.0  2.0   0.0  0.0  18.0  55.0  0.0
2           Released  46.0  1.0  1.0  65.0  1.0  15.0  69.0  3.0

In [28]:
warehouse_df4 = warehouse_df4.rename_axis(None, axis=1)
warehouse_df4

      Status    10  102   12    15   16    19    20   21
0  Completed   9.0  0.0  0.0   0.0  0.0  29.0   5.0  0.0
1  Executing  17.0  0.0  2.0   0.0  0.0  18.0  55.0  0.0
2   Released  46.0  1.0  1.0  65.0  1.0  15.0  69.0  3.0

In [29]:
# Save Warehouse into JSON file
warehouse_df4.to_json('data/warehouse.json')

In [30]:
# Close connection
cnxn.close()